Repository: lf-j/OpenSourceComplianceHandbook-Translation
Catalog: tm/Ibrahim_Compliance-level1.tmx
Source language: en_us
Languages: ja

source: This program is free software; you can redistribute it and/or modify it under the terms of the GNU General Public License as published by the Free Software Foundation; either version 2 of the License, or (at your option) any later version.
ja: このプログラムはフリー ソフトウェアです。したがって、Free Software Foundation によって公開された GNU General Public License (GNU 一般公衆利用許諾書) version 2 以降の下で再配布および/または修正することができます。

source: Refresher training on OSS compliance is provided periodically.
ja: OSS コンプライアンスに関する再教育を定期的に実施する。

source: The elements of a successful compliance program that will allow a company to capture, govern and track all software components (proprietary, 3rd party commercial and FOSS) included in its commercial products.
ja: 企業が自社製品に含まれるすべて (プロプライエタリ、サード パーティ、FOSS) のソフトウェア コンポーネントを取得、管理、および追跡できるコンプライアンス プログラムに必要な要素

source: Copy build results to deployment and/or download servers and/or perform installation on target systems.
ja: ビルド結果をデプロイメント サーバーやダウンロード サーバーにコピーする、および/または、ターゲット システムにインストールする。

source: On the following Tuesday, the weekly release is finalized and sent to the QA team for testing.
ja: 翌週の火曜日には、ウィークリー リリースが完了し、テストのために QA チームに送られます。

source: a)The consequent scope of review and approval authority is determined.
ja: 調査と承認プロセスの権限によって出された結論の適用範囲を定めること。

source: In this paper, we provide an overview of the various elements that contribute to the success of FOSS compliance and discuss top challenges that a company has to deal with when establishing and maintaining their compliance programs and how to overcome these challenges.
ja: このホワイト ペーパーでは、FOSS コンプライアンスを成功に導くさまざまな要素の概要を説明しました。また、企業が自社のコンプライアンス プログラムを確立および維持する際に処理しなければならない代表的課題と、それらの克服方法について学習しました。

source: In additon, using fingerprints, while accurate, does not report any changes the author may have made to a common license or license notice.
ja: また、フィンガープリントを使用すれば正確だが、もし著者によって共通ライセンスやライセンス告知が変更されていても、報告しない。

source: An initial compliance baseline for a product is established with the aid of scanning tools, whenever it is advantageous to do so.
ja: 製品の最初のコンプライアンス ベースラインを構築するのに、その利用が有益である場合は、常にスキャニング ツールを活用していること。

source: If a linkage issue was found, a bug ticket is assigned to Engineering with a description of the issue in addition to a proposal on how to solve the issue.
ja: リンク問題が見つかった場合は、問題の説明と解決案を添えて、技術担当者あてにバグ チケットを発行します。

source: In addition, if a translation error occurs, the results could be catastrophic.
ja: また、誤訳があれば、大きな問題に発展する恐れがあります。

source: Tools
ja: ツール

source: Supply Chain Team (Business Development)
ja: サプライ チェーン チーム (ビジネス開発)

source: In this model, software components can consist of source code origination from different sources and licensed under different licenses; for instance, software component A can include proprietary source code in addition to 3rd party proprietary source code, while software component B can include proprietary source code in addition to source code from an open source project.
ja: このモデルでは、複数の異なる開発元を持ち、異なるライセンス条件の下で使用許可されているソース コードのソフトウェア コンポーネントで構成されています。たとえば、ソフトウェア コンポーネント A ではサード パーティのプロプライエタリ ソース コードと自社のプロプライエタリ ソース コードを組み合わせ、ソフトウェア コンポーネント B ではオープン ソース プロジェクトのソース コードと自社のプロプライエタリ ソース コードを組み合わせるということが起きています。

source: Making inappropriate or misleading statements in the product documentation or product advertisement material
ja: 製品情報または製品広告物の中で不適切または誤解を招く表現を用いないか

source: Therefore, it is critical to identify and audit all source code included in a product.
ja: したがって、製品に組み込まれているすべてのソース コードを識別し、監査することが必須です。

source: Process adherence audits are used to determine whether the organization follows its defined compliance process.
ja: 「プロセス順守の監査」は、組織が定義されたコンプライアンス プロセスに従っているかどうかを確認する。

source: FOSSology supports various methods for loading files for analysis:
ja: FOSSology はさまざまな解析ファイル読み込みメソッドに対応しています。

source: Start first by watching the Linux Foundation’s free webinar, “Introduction to Embedded Linux with Jerry Cooperstein”, and see where your imagination takes you.
ja: まずは The Linux Foundation の無料ウェビナー “Introduction to Embedded Linux with Jerry Cooperstein (Jerry Cooperstein による組込み Linux 入門)" を受講してみてください。

source: Overview of open source development
ja: オープン ソース開発の概要

source: The first challenge is to create the compliance program and its supporting infrastructure while achieving the right balance between following processes and meeting product ship deadlines.
ja: 第一の課題は、プロセス間のバランスを保ち、かつ製品の出荷期日を守りながら、コンプライアンス プログラムとそれをサポートする基盤を作成することです。

source: i)Response actions are given high priority and issues are escalated to an appropriate level of management.
ja: i) 応答作業には、高い優先順位がつけられ、問題は適切な管理者層に報告される。

source: A next step is for the working group to assemble a list of key projects for which to create SPDX(TM) reports, and to get those done by any method possible.
ja: 次のステップは、ワーキング グループが、SPDX(TM) レポート作成の対象となる重要プロジェクトのリストを作成し、考えられるあらゆる手法を用いてそれらを実行することです。

source: Include compliance checkpoints as part of the software development process (discussed earlier)
ja: ソフトウェア開発プロセスの一部にコンプライアンスのチェックポイントを含める (前述)

source: How to extend the compliance program to an organization’s 3rd party suppliers
ja: サードパーティ サプライヤーにコンプライアンス プログラムを広げるには

source: For more information: Download the Dependency Checker Tool Overview
ja: 詳細情報: Download the Dependency Checker Tool Overview

source: This whitepaper represents the second paper in a series of three papers on OBS.
ja: このホワイトペーパーは、OBS に関する 3 つのホワイトペーパーの 2 つ目です。

source: Compliance helps achieve four main objectives:
ja: コンプライアンスは、次の 4 つの目的の達成を支援します。

source: If the compliance inquiry was a false alarm, you will close the compliance inquiry ticket without any further action after ensuring that the inquirer is satisfied with your response.
ja: コンプライアンスの照会が誤報だった場合は、照会質問者があなたの対応に満足していることを確認した上で、それ以上の行動はとらずに、そのコンプライアンス照会チケットをクローズします。

source: The spec includes:
ja: 仕様には、以下のものが含まれます。

source: Figure 10.
ja: 図 10

source: It is recommended to identify all the incoming software components and pass all of them into the source code auditing phase based on tasks they receive from the core team or the OSRB.
ja: コア チームやオープンソース調査委員会 (OSRB) からの指示に基づいて、利用するソフトウェア コンポーネントをすべて識別し、それらをすべてソース コード監査のステップに渡すことをお勧めします。

source: Staffing
ja: 人材

source: Link Analysis Review
ja: リンク解析レビュー

source: Those just starting down the road of establishing a compliance program will especially benefit from The Linux Foundation's training courses on Open Source compliance rather than relying solely on this checklist.
ja: コンプライアンス プログラムの履行を開始して間もない場合は、このチェックリストを使用するだけでなく、The Linux Foundation のオープン ソース コンプライアンス トレーニング コースも受講するとよいでしょう。

source: This section provides recommendations on four essential training courses:
ja: ここでは、以下の 4 種類の基本トレーニング コースをお勧めします。

source: Yes / No / Not Applicable
ja: はい/いいえ/あてはまらない

source: Also check out the Qi NanoNote, an ultra-tiny notebook.
ja: 超小型ノートブックの Qi NanoNote についても、ぜひ調べてみてください。

source: Our hope with this paper is to provide some insight on how to structure your FOSS compliance team to be as effective as possible and well integrated within the organization and not regarded as a separate entity adding overhead to the development process.
ja: このペーパーの目的は、できるかぎり効果的で、しかも開発プロセスに負荷が加わるような独立した組織ではなく、組織内でうまく統合された FOSS コンプライアンス チームの構成方法についての見識を提供することです。

source: Suggestions for improvement of the Self-Assessment Checklist will be appreciated, in addition to feedback on the manner in which organizations are using the checklist.
ja: 自己診断チェックリストの改善案や、チェックリストの使用方法に関するフィードバックをぜひお送りください。

source: c)Verification activities assure that source code to be distributed has been cleansed of any inappropriate comments.
ja: c) 配布予定のソース コードからすべての不適切なコメントが削除されていることを保証するために検証作業を行うこと。

source: For Distributors and ISVs
ja: ディストリビューターや ISV 向け

source: The author would like to express his gratitude to Karen Copenhaver (Legal Director of the Linux Foundation and Partner in Choate, Hall & Stewart LLP 's Business & Technology practice) for her reviews and valuable input.
ja: このホワイトベーパーの作成にあたっては、Karen Copenhaver 氏 (Linux Foundation のリーガル ディレクター兼 Choate, Hall & Stewart LLP 社 Business & Technology practice 所属のパートナー) から貴重なレビューとアドバイスをいただきました。ありがとうございました。

source: Mandate compliance code inspections as part of the software development process
ja: ソフトウェア開発プロセスの一環として、コンプライアンス コード検査を義務付ける

source: Some companies call this process a linguistic review
ja: この処理はリンギスティック レビュー (言語品質チェック) とも呼ばれる

source: - Follow compliance policies and processes
ja: コンプライアンス ポリシーとプロセスを順守する

source: By marshaling the resources of its members and leaders in the compliance community, the Linux Foundation brings together the individuals, companies and legal entities needed to expand the use of open source software while decreasing legal costs and FUD.
ja: コンプライアンス コミュニティのメンバーやリーダーのリソースを集結させることにより、The Linux Foundation ではオープン ソース ソフトウェアを広く普及させるために必要な個人、企業、および法務などの要素を結集すると同時に、法務関連のコストや FUD (不安や懸念) を低減します。

source: Organizations may also wish to consider ways of aggregating the appraisal of individual practices into a composite view of compliance capability.
ja: また、個々のプラクティスの評価を集約し、全体的なコンプライアンス活動の展望を明らかにする方法を知ることが必要な組織もあるでしょう。

source: Furthermore, if engineering teams want to use the same software component in a different product, they need to issue a new request.
ja: また、エンジニアリング チームが、同じソフトウェア コンポーネントを別の製品に使用する場合も、新たに申請し直す必要があります。

source: Software Inventory / Recordkeeping
ja: ソフトウェア インベントリ / 記録管理

source: In a future paper, we will discuss these tools and explain how they contribute to ensuring FOSS compliance in a very efficient and accurate way.
ja: これらのツールを効率的かつ正確に活用して、FOSS コンプライアンスを徹底する方法については、今後公開するホワイトペーパーで説明する予定です。

source: It is enabled in our blueprint above by allowing the Microsoft OEM ignition system to install the OEM PK instead of generating a new PK specific to the installation.
ja: これは、インストール時に新しいプラットフォーム鍵を生成する代わりに、Microsoft OEM の提供するイグニッション システムが OEM プラットフォーム鍵をインストールできるようにします。

source: d)The organization tracks progress of obligation satisfaction for a product being readied for release.
ja: 組織は、リリース準備中の製品について、義務履行の進捗を追跡する。

source: Many other conferences happen every year.
ja: このほかにも、毎年多くのカンファレンスが開催されています。

source: Figure 11.
ja: 図 11

source: A request for an update to the attribution and/or copyright notice that possibly was lacking or incomplete
ja: 不足している、または不完全な帰属告知や著作権告知に関する更新の要求

source: The Linux Foundation has created three training courses on open compliance:
ja: The Linux Foundation では、以下のようなオープン コンプライアンス トレーニング コースを提供しています。

source: External Communication
ja: 外部とのコミュニケーション

source: Establish lightweight policies and processes (discussed earlier)
ja: 軽量なポリシーとプロセスを確立する (前述)

source: Compliance policies and processes govern the various aspects of using, contributing, auditing, and distribution of FOSS.
ja: コンプライアンスのポリシーとプロセスは、FOSS の使用、コントリビュート、監査、および配布について多面的に管理します。

source: To promote the training and provide a preview of content, The Linux Foundation will offer a free two-hour mini-workshop on open source compliance. Conducted by Dr. Philip Koltun, Director, Open Compliance Program, the presentation will focus on the core compliance processes of open source disclosure and discovery, review and approval, and satisfaction of obligations. Dr. Koltun will discuss basic practices, implementation issues, and tools available to assist in execution of these processes.
ja: The Linux Foundation では、このトレーニングのご案内とコース概要の説明を兼ねて、2 時間の OSS コンプライアンス ミニワークショップ (無料) を開催いたします。オープン コンプライアンス プログラムのディレクターである Dr. Philip Koltun によるこのプレゼンテーションは、オープン ソースの開示・検出、調査・承認、義務の履行といった主要なコンプライアンス プロセスにフォーカスしています。また、これらのプロセスを実行する際に役立つ基本プラクティス、実装上の問題、利用可能なツールについても説明します。

source: LF281 Executive Review of Open Source Compliance. Half-day training, for executive management, focusing on the importance of compliance and what must be done to satisfy open source license obligations.
ja: LF281 オープン ソース コンプライアンスの LF エグゼクティブ レビュー。エグゼクティブ管理者層のための半日トレーニングで、コンプライアンスの重要性、およびオープン ソース ライセンス義務を果たすために行うべきことに焦点を絞っています。

source: More than a Build System
ja: ビルド システム機能を超えるもの

source: Source Code and License Identification Tool
ja: ソース コード&ライセンス識別ツール

source: Two-day comprehensive coverage of the compliance process.
ja: 2 日間のトレーニング。コンプライアンス プロセスに関する包括的なコース。

source: Therefore, the supply chain for products requires developers to create a ‘software pedigree’ that includes information necessary to avoid misuse and mitigate risk.
ja: 製品のサプライ チェーンは、開発者が「ソフトウェアの血統書」を作成し、これに誤用防止やリスク低減のための情報を含めることを要求する。

source: It introduces and explains basic legal concepts related to the GPL and its enforcement by copyright holders.
ja: このガイドでは、GPL に関する基本的な法律概念や、著作権所有者による法執行について紹介および説明しています。

source: Free and open source software enables companies to accelerate product innovation by collaborating with a global community of developers.
ja: 企業は、フリー&オープン ソース ソフトウェアを利用することにより、世界中の開発者コミュニティと協力して、製品の技術革新を加速することができます。

source: Engineering
ja: 技術部門

source: d)OSRB procedures (inputs to a review, participants, review procedures, analysis procedures, decision outcomes, appeal and waiver procedures, etc.)
ja: d) OSRB の手続き (調査のための入力、参加者、調査手順、分析手順、結論、上訴、および棄却手順など)

source: This is an example of the conventional way to analyze a file where:
ja: これは、ファイルの通常解析の例です。次のような処理が行われます。

source: To obtain a copy of the source code being made publicly available by FooBar, Inc. related to software used in this FooBar product, you can visit http://opensource.foobar.com or send your request in writing by email to opensource@foobar.com or by snail mail to:
ja: この FooBar 製品で使用しているソフトウェアに対応する FooBar, Inc. 公開のソース コードのコピーを入手するには、http://opensource.foobar.com からダウンロードするか、opensoue@foobar.com 宛てに電子メールで、または下記住所あてに郵便で請求してください。

source: Figure 12.
ja: 図 12

source: - Updating end user documentation to reflect FOSS usage in product
ja: エンドユーザー向けドキュメントを更新し、製品で使用している FOSS を反映させる

source: - Change request tickets are filed against the appropriate engineering team for any issues identified during the audit that require resolution.
ja: 監査で判明したすべての問題を解決するために、エンジニアリング チームに対して変更依頼チケットが提出される。

source: The OSRB is responsible for establishing the end-to-end compliance process which covers all aspects related to using FOSS in a commercial product in addition to creating and maintaining compliance policies, processes, guidelines, templates and forms used in the compliance program.
ja: OSRB は、コンプライアンス プログラムで使用するコンプライアンス ポリシー、プロセス、ガイドライン、テンプレート、フォームの作成および保守を行うほか、商品への FOSS 使用に関するあらゆる局面をカバーする詳細なコンプライアンス プロセスを確立する責任を負います。

source: Community Contributions
ja: コミュニティへの貢献

source: Highlight your compliance program
ja: 自社のコンプライアンス プログラムを強調する

source: Participation can be in the form of submitting new source code, documentation, submitting bugs, providing enhancements, testing, writing papers about FOSSology or speaking at conferences.
ja: 新しいソース コードの提出、文書作成、バグ報告、拡張機能の提供、テスト、FOSSology に関する記事の投稿、カンファレンスでの講演など、さまざまな形で参加できます。

source: There is one dispatcher per OBS which keeps track of the states of all worker in the system.
ja: システムのすべてのワーカーのステートを記録する OBS ごとに 1 つのディスパッチャーが存在します。

source: The OSRB reviews requests for use, modification, and distribution of FOSS and determines approval.
ja: ORSB は FOSS の使用、変更、および配布についての要求をレビューし、承認を決定します。

source: Approval or denial of usage of the specific component.
ja: 対象のコンポーネントの使用の承認または却下

source: Typical failures of the compliance process and how to avoid them
ja: コンプライアンス プロセスのよくある失敗とその防ぎ方

source: The role and responsibilities of the teams involved in achieving FOSS compliance
ja: FOSS コンプライアンスの履行に関わるチームの役割と責任

source: The API offers machine-to-machine interface for the OSC command line client or for integration with other systems such as IDEs (for instance a plugin for Eclipse is available).
ja: API は、OSC コマンド ライン クライアントのための、あるいは、IDE のような他のシステムと統合するためのマシンツーマシン インタフェースを提供します (たとえば Eclipse 向けのプラグインが利用可能な場合)。

source: Compliance End-to-End Management
ja: コンプライアンスの徹底管理

source: FOSSology provides a framework for software analysis and offers tools that allow you to discover licenses and copyrights, parse package files, and categorize files and packages.
ja: FOSSology は、ソフトウェア解析のフレームワークを提供しています。また、ライセンスや著作権情報の検出、パッケージ ファイルの文法解析、およびファイルやパッケージの分類を行うツールを提供しています。

source: Documentation Team
ja: ドキュメンテーション チーム

source: iii)Modifications to the organization's defined compliance process are made as appropriate to prevent recurrence of compliance issues.
ja: iii) コンプライアンス問題の再発を防止するために、組織が定めたコンプライアンス プロセスに対して、適宜、変更が行われること。

source: When the requirements grow, the appliance can be extended following a systematic approach into a fully distributed build service with database and repository backends running on different systems and a multitude of workers building packages for different architectures and distributions.
ja: 要件が増えるにつれて、アプライアンスを体系的に拡張することができ、異なるアーキテクチャやディストリビューション用のパッケージをビルドして、異なるシステムや複数のワーカーで動作するデータベースやリポジトリ バックエンドを持つ完全分散ビルド サービスにすることができます。

source: Compiler flags and other settings can be individually defined per architecture.
ja: コンパイラーのフラグなどの設定は、アーキテクチャごとに個々に設定できます。

source: Figure 13.
ja: 図 13

source: The name of the product affected
ja: 影響を受ける製品の名前

source: Running the Analysis
ja: 解析の実行

source: - The product implementation includes only the approved FOSS
ja: 製品には、承認済みの FOSS だけが含まれていること

source: (In ISO 9000 terminology, minor deviations or nonconformities, though significant and requiring corrective actions, could be numerous but still not present a certification obstacle.
ja: (ISO 9000 の用語では、小さな逸脱や非準拠は、重要であり、正しい対処が必要ですが、大量に検出されることもあり、それでもそれらが認定の障害にはなりません。◆◆

source: As part of the pre- distribution process, the OSRB performs final checks before the product ships, including verifying the fulfillment of obligations.
ja: OSRB は、配布前の処理の一環として、義務履行の検証をはじめとする製品出荷前の最終チェックを行います。

source: Scope of an open compliance program
ja: オープン コンプライアンス プログラムの範囲

source: - FOSS received from a third party vendor
ja: サードパーティ ベンダーから FOSS の提供を受けた

source: Approvals
ja: 承認

source: Integrate Compliance Milestones as Part of the Development Process
ja: ソフトウェア開発プロセスの一環として、コンプライアンスの確認ポイントを組み込む

source: Sat/Sun
ja: 土/日

source: Therefore, companies should not ignore compliance inquiries, and instead, they should acknowledge the receipt of the inquiry, inform the reporter that they will be looking into it, and provide a certain date on when to expect a follow-up.
ja: 企業はコンプライアンスに関する照会を無視するべきではありません。照会があったことを確認し、これから調査することを照会者に伝え、明確な回答予定日を提示する必要があります。

source: They include:
ja: たとえば、以下のようなツールがあります。

source: Excellent discussion forums exist:
ja: ディスカッション フォーラムには、以下のようなものがあります。

source: - Analyze the results and resolve all the possible matches and licensing conflicts as flagged by the scanning tool
ja: - その結果を解析し、スキャン ツールが示した一致やライセンス準拠違反の可能性についてすべて解決する

source: Secondarily, this page will list other open source tools of value to the compliance process and commercial tools that may be of interest.
ja: またこのページでは、コンプライアンス プロセスに役立つその他のオープン ソース ツールや、関心を持たれそうな商用ツールも紹介しています。

source: - FOSSBazaar: An open community of technology and industry leaders who are collaborating to accelerate adoption of free and open source software in the enterprise.
ja: FOSSBazaar: 企業におけるフリー&オープン ソース ソフトウェア導入を促進するために協力し合う技術/業界リーダーのオープン コミュニティです。

source: Clearly, there’s a need to create a set of software package data exchange(TM) standards that will eliminate ambiguity for software development organizations, systems and tool vendors, and open source projects - one that is supported by best practices, use cases and prototype tools - that can be used by a broad range of constituents.
ja: 一連のソフトウェア パッケージ データ交換 (software package data exchange(TM)) 標準規格を作成し、ソフトウェア開発組織や、システム/ツール ベンダーや、オープン ソース プロジェクトのために、曖昧さを排除する必要があるのは明らかです。そしてそれは、ベストプラクティス、使用事例、プロトタイプ ツール などによって裏付けられ、さまざまな組織で使用できる必要があります。

source: - Decide on distribution method and mode
ja: 配布の方法とモードの決定

source: Continuous audits of all source code integrated in the code base regardless of its origins (FOSS, third party or proprietary)
ja: 開発元 (FOSS、サードパーティ、プロプライエタリ) に関係なく、コードベースで統合されたすべてのソース コードの継続的監査。

source: Mobile software providers have been particularly forthcoming in recent years.
ja: モバイル ソフトウェア プロジェクトは、特に近年活発になっています。

source: Establishing a Trust Model
ja: 信頼モデル (Trust Model) の確立

source: Facts that provide overview information about a software package’s content also are included in the SPDX(TM) specification, e.g.:
ja: また、SPDX™ の仕様書では、ソフトウェア パッケージの内容に関する概要情報として、次のようなものを挙げています。

source: 3rd Party Commercial
ja: サード パーティ商用

source: Ideally, you should not rely on engineers to remember if they made code changes.
ja: コードの改変に関して、技術者の記憶を頼るべきではないでしょう 。

source: Vendors of Commercial Compliance Tools
ja: 商用コンプライアンスツールのベンダー

source: When the file is analyzed, the discovered license names are returned to the user via the web browser interface.
ja: ファイルが解析されると、検出されたライセンス名は Web ブラウザ インタフェースを介してユーザーに返されます。

source: For instance, a worker deployed on an ARM-based system can build packages for ARM natively.
ja: たとえば、ARM ベースのシステムにデプロイされたワーカーは、ARM ネイティブのパッケージをビルドできます。

source: Pre-distribution verifications as part of the compliance end-to-end process
ja: コンプライアンス プロセスの「配布前の検証」ステップ

source: The organization defines what modes of external software conveyance trigger license obligations and assures that any software thus released meets compliance requirements.
ja: 組織は、ライセンス義務を発生させる外部ソフトウェアの譲渡方法を定義し、そのように受け入れたすべてのソフトウェアがコンプライアンス要件を満たしていることを保証すること。

source: The above resources join the existing FOSSBazaar workgroup which has a thriving and informed community of software and compliance professionals.
ja: 上記の各リソースは、既存のワークグループである FOSSBazzar に加わります。FOSSBazzar とは、ソフトウェアとコンプライアンス専門家のコミュニティです。

source: The architecture review is an analysis of the interaction between FOSS and proprietary and third party software components.
ja: アーキテクチャ レビューとは、FOSS とプロプライエタリやサード パーティのソフトウェア コンポーネントとの間の相互関係を解析することです。

source: Alternatively (as with ISO 9000 certification appraisals), major and minor “deviations” may be noted in a summary report.
ja: ◆◆また (ISO 9000の 認定評価のように)、サマリ レポートには、大小の「偏差」が認められることがあります。

source: Such denials of process weaknesses inevitably lead to compliance problems.
ja: プロセスの弱点を認めなければ、間違いなくコンプライアンス問題に発展します。

source: Companies must now deal with dozens of different licenses, and hundreds or even thousands of licensors and contributors.
ja: 企業は何十種類ものライセンス、さらに何百人または何千人ものライセンス保持者やコントリビューターに対応しなければなりません。

source: One common result from all the incompliance cases was that the company with the violation had to comply with the license.
ja: あらゆるコンプライアンス違反の例からわかることは、違反企業はライセンス条件を順守するべきだったということです。

source: This can be achieved simply and securely because only the public half of the PK needs to be carried by the ignition system to effect this lockdown of the platform.
ja: プラットフォーム鍵の公開部分だけがイグニッション システムによって運ばれ、プラットフォームのロックダウンを完成させるため、シンプルかつ安全な方法です。

source: OSS Inventory / Recordkeeping
ja: OSS インベントリ / 記録管理

source: - Open Compliance Directory and Rapid Alert System: http://www.linuxfoundation.org/programs/legal/compliance/directory
ja: オープン コンプライアンス ディレクトリと緊急警報システム: http://www.linuxfoundation.jp/programs/legal/compliance/directory

source: The reviewers need to understand the licenses that govern use, modification and distribution of the software and identify the obligations of the various licenses.
ja: 調査担当者は、ソフトウェアの使用、改変、配布を管理するライセンスについて理解し、さまざまなライセンスの義務について認識する必要があります。

source: - Resolving any issues uncovered by the audit
ja: 監査で検出された問題を解決する

source: Free and Open Source
ja: フリー & オープン ソース

source: They serve the free software community by providing the public with a "knowledge infrastructure" surrounding the GNU GPL and free software licensing, and enforcing the license on FSF-copyrighted software.
ja: The FSF Compliance Lab は、GNU GPL とフリー ソフトウェア ライセンスを取り巻く「知識基盤」を公に提供し、FSF に著作権のあるソフトウェアのライセンスを徹底することにより、フリー ソフトウェア コミュニティをサポートします。
